app/Controllers/MonitoringTask.php

SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
SELECT *
FROM `usergroup`
WHERE `usergroup`.`deleted_at` IS NULL
---
    public function daftar_task_karyawan()
    {
        $usergroup = $this->usergroupModel->findAll();

SELECT *
FROM `usergroup`
WHERE `usergroup`.`deleted_at` IS NULL
---
    public function filter()
    {
        $id_usergroup = $this->request->getGet('filter_monitoring_usergroup');
        $tanggal_mulai = $this->request->getGet('filter_tanggal_mulai');
        $tanggal_selesai = $this->request->getGet('filter_tanggal_selesai');

        $usergroup = $this->usergroupModel->findAll();

SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
AND `user`.`id_user` = '7'
SELECT *
FROM `kategori_task`
WHERE `kategori_task`.`deleted_at` IS NULL
SELECT *
FROM `status_task`
WHERE `status_task`.`deleted_at` IS NULL
SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
---
    public function detail_task_karyawan($id_user)
    {
        // Load user model
        $userModel = new \App\Models\UserModel();

        // Cari user yang mau ditampilkan detail task-nya
        $user = $userModel->find($id_user);

        // Cek: pastikan user ada, dan user_level-nya staff/supervisi/admin
        if (!$user || !in_array($user['user_level'], ['staff', 'supervisi', 'admin'])) {
        throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Data user tidak ditemukan atau akses tidak diizinkan.');
        }

        // Ambil filter dari GET
        $tanggal_mulai = $this->request->getGet('filter_tanggal_mulai') ?? '';
        $tanggal_selesai = $this->request->getGet('filter_tanggal_selesai') ?? '';
        $id_usergroup = $this->request->getGet('filter_monitoring_usergroup') ?? '';

        // Ambil data task user tersebut
        $tasks = $this->monitoringModel->getAllTaskByUserFiltered($id_user, $tanggal_mulai, $tanggal_selesai);

        // Load data tambahan
        $kategoriTaskModel = new \App\Models\KategoriTaskModel();
        $statusTaskModel = new \App\Models\StatusTaskModel();

        $kategori_task = $kategoriTaskModel->findAll();
        $status_task = $statusTaskModel->findAll();
        $users = $userModel->findAll();