app/Controllers/Pekerjaan.php

    public function detail_task_on_progress($id_pekerjaan)
    {
        if (session()->get('user_level') != 'hod') {
            // Misalnya redirect ke halaman daftar_pekerjaan dengan pesan error
            return redirect()->to('/pekerjaan/daftar_pekerjaan')->with('error', 'Akses ditolak.');
        }
        $task_on_progress = $this->pekerjaanModel->getTaskOnProgressByPekerjaan($id_pekerjaan);
        $kategori_task = $this->kategoriTaskModel->findAll();
---
SELECT *
FROM `kategori_task`
WHERE `kategori_task`.`deleted_at` IS NULL

    public function detail_task_overdue($id_pekerjaan)
    {
        if (session()->get('user_level') != 'hod') {
            // Misalnya redirect ke halaman daftar_pekerjaan dengan pesan error
            return redirect()->to('/pekerjaan/daftar_pekerjaan')->with('error', 'Akses ditolak.');
        }
        $task_overdue = $this->pekerjaanModel->getTaskOverdueByPekerjaan($id_pekerjaan);
        $kategori_task = $this->kategoriTaskModel->findAll();
---
SELECT *
FROM `kategori_task`
WHERE `kategori_task`.`deleted_at` IS NULL

    public function detail_task_ontarget($id_pekerjaan)
    {
        if (session()->get('user_level') != 'hod') {
            // Misalnya redirect ke halaman daftar_pekerjaan dengan pesan error
            return redirect()->to('/pekerjaan/daftar_pekerjaan')->with('error', 'Akses ditolak.');
        }
        $task_ontarget = $this->pekerjaanModel->getTaskOnTargetByPekerjaan($id_pekerjaan);
        $kategori_task = $this->kategoriTaskModel->findAll();
---
SELECT *
FROM `kategori_task`
WHERE `kategori_task`.`deleted_at` IS NULL