app/Models/MonitoringTaskModel.php

SELECT `u`.`id_user`, `u`.`nama` AS `nama_karyawan`, `ug`.`nama_usergroup` AS `usergroup`, COUNT(
                    CASE 
                        WHEN t.tgl_selesai IS NULL AND NOW() <= t.tgl_planing 
                        THEN 1 
                    END
                ) AS task_on_progress, COUNT(
                    CASE 
                        WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai = t.tgl_planing 
                        THEN 1 
                    END
                ) AS task_ontarget, COUNT(
                    CASE 
                        WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai < t.tgl_planing 
                        THEN 1 
                    END
                ) AS task_percepatan, COUNT(
                    CASE 
                        WHEN (t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing)
                        OR (t.tgl_selesai IS NULL AND NOW() > t.tgl_planing)
                        THEN 1 
                    END
                ) AS task_overdue
FROM `user` `u`
LEFT JOIN `usergroup` `ug` ON `ug`.`id_usergroup` = `u`.`id_usergroup`
LEFT JOIN `task` `t` ON `t`.`id_user` = `u`.`id_user` AND `t`.`deleted_at` IS NULL
WHERE `u`.`deleted_at` IS NULL
AND `u`.`id_usergroup` IS NOT NULL
AND `u`.`user_level` IN ('staff','supervisi')
GROUP BY `u`.`id_user`
ORDER BY `u`.`nama` ASC
---
    public function getMonitoringTaskPerKaryawan()
    {
        return $this->db->table('user u')
            ->select([
                'u.id_user',
                'u.nama AS nama_karyawan',
                'ug.nama_usergroup AS usergroup',
                "COUNT(
                    CASE
                        WHEN t.tgl_selesai IS NULL AND NOW() <= t.tgl_planing
                        THEN 1
                    END
                ) AS task_on_progress",
                "COUNT(
                    CASE
                        WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai = t.tgl_planing
                        THEN 1
                    END
                ) AS task_ontarget",
                 "COUNT(
                    CASE
                        WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai < t.tgl_planing
                        THEN 1
                    END
                ) AS task_percepatan",
                "COUNT(
                    CASE
                        WHEN (t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing)
                        OR (t.tgl_selesai IS NULL AND NOW() > t.tgl_planing)
                        THEN 1
                    END
                ) AS task_overdue"
            ])
            ->join('usergroup ug', 'ug.id_usergroup = u.id_usergroup', 'left')
            ->join('task t', 't.id_user = u.id_user AND t.deleted_at IS NULL', 'left')
            ->where('u.deleted_at IS NULL')
            ->where('u.id_usergroup IS NOT NULL')
            ->whereIn('u.user_level', ['staff', 'supervisi'])
            ->groupBy('u.id_user')
            ->orderBy('u.nama', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `task`
WHERE `id_user` = '7'
AND `deleted_at` IS NULL
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC
---
    public function getMonitoringTaskPerKaryawanFiltered($id_usergroup = null, $tanggal_mulai = null, $tanggal_selesai = null)
    {
        $builder = $this->db->table('user u')
            ->select([
                'u.id_user',
                'u.nama AS nama_karyawan',
                'ug.nama_usergroup AS usergroup',
                "COUNT(
                    CASE
                        WHEN t.tgl_selesai IS NULL AND NOW() <= t.tgl_planing
                        THEN 1
                    END
                ) AS task_on_progress",
                "COUNT(
                    CASE
                        WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai = t.tgl_planing
                        THEN 1
                    END
                ) AS task_ontarget",
                 "COUNT(
                    CASE
                        WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai < t.tgl_planing
                        THEN 1

SELECT *
FROM `task`
WHERE `id_user` = '22'
AND `deleted_at` IS NULL
AND `tgl_planing` >= '2025-01-01'
AND `tgl_planing` <= '2025-01-30'
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC
---
    public function getAllTaskByUserFiltered($id_user, $tanggal_mulai, $tanggal_selesai)
    {
        $builder = $this->where(['id_user' => $id_user, 'deleted_at' => null]);

        if ($tanggal_mulai && $tanggal_selesai) {
            $builder->where('tgl_planing >=', $tanggal_mulai);
            $builder->where('tgl_planing <=', $tanggal_selesai);
        }

        return $builder->orderBy('tgl_planing', 'ASC')
            ->findAll();