app/Models/MonitoringTaskModel.php

    public function getMonitoringTaskPerKaryawan()
    {
        return $this->db->table('user u')
            ->select([
                'u.id_user',
                'u.nama AS nama_karyawan',
                "COUNT(CASE WHEN t.tgl_selesai IS NULL THEN 1 END) AS task_on_progress",
                "COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai <= t.tgl_planing THEN 1 END) AS task_selesai",
                "COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing THEN 1 END) AS task_overdue"
            ])
            ->join('task t', 't.id_user = u.id_user AND t.deleted_at IS NULL', 'left')
            ->where('u.deleted_at IS NULL')
            ->where('u.id_usergroup IS NOT NULL')
            ->whereIn('u.user_level', ['staff', 'supervisi'])
            ->groupBy('u.id_user')
            ->orderBy('u.nama', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `u`.`id_user`, `u`.`nama` AS `nama_karyawan`, COUNT(CASE WHEN t.tgl_selesai IS NULL THEN 1 END) AS task_on_progress, COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai <= t.tgl_planing THEN 1 END) AS task_selesai, COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing THEN 1 END) AS task_overdue
FROM `user` `u`
LEFT JOIN `task` `t` ON `t`.`id_user` = `u`.`id_user` AND `t`.`deleted_at` IS NULL
WHERE `u`.`deleted_at` IS NULL
AND `u`.`id_usergroup` IS NOT NULL
AND `u`.`user_level` IN ('staff','supervisi')
GROUP BY `u`.`id_user`
ORDER BY `u`.`nama` ASC

    public function getMonitoringTaskPerKaryawanFiltered($id_usergroup = null, $tanggal_mulai = null, $tanggal_selesai = null)
    {
        $builder = $this->db->table('user u')
            ->select([
                'u.id_user',
                'u.nama AS nama_karyawan',
                "COUNT(CASE WHEN t.tgl_selesai IS NULL THEN 1 END) AS task_on_progress",
                "COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai <= t.tgl_planing THEN 1 END) AS task_selesai",
                "COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing THEN 1 END) AS task_overdue"
            ])
            ->join('task t', 't.id_user = u.id_user AND t.deleted_at IS NULL', 'left')
            ->where('u.deleted_at IS NULL')
            ->where('u.id_usergroup IS NOT NULL')
            ->whereIn('u.user_level', ['staff', 'supervisi']);

        if ($id_usergroup) {
            $builder->where('u.id_usergroup', $id_usergroup);
        }

        if ($tanggal_mulai && $tanggal_selesai) {
            $builder->where('t.tgl_planing >=', $tanggal_mulai);
            $builder->where('t.tgl_planing <=', $tanggal_selesai);
        }

        return $builder->groupBy('u.id_user')
            ->orderBy('u.nama', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `u`.`id_user`, `u`.`nama` AS `nama_karyawan`, COUNT(CASE WHEN t.tgl_selesai IS NULL THEN 1 END) AS task_on_progress, COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai <= t.tgl_planing THEN 1 END) AS task_selesai, COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing THEN 1 END) AS task_overdue
FROM `user` `u`
LEFT JOIN `task` `t` ON `t`.`id_user` = `u`.`id_user` AND `t`.`deleted_at` IS NULL
WHERE `u`.`deleted_at` IS NULL
GROUP BY `u`.`id_user`
ORDER BY `u`.`nama` ASC