app/Models/MonitoringTaskModel.php

SELECT `u`.`id_user`, `u`.`nama` AS `nama_karyawan`, COUNT(CASE WHEN t.tgl_selesai IS NULL THEN 1 END) AS task_on_progress, COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai <= t.tgl_planing THEN 1 END) AS task_selesai, COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing THEN 1 END) AS task_overdue
FROM `user` `u`
LEFT JOIN `task` `t` ON `t`.`id_user` = `u`.`id_user` AND `t`.`deleted_at` IS NULL
WHERE `u`.`deleted_at` IS NULL
GROUP BY `u`.`id_user`
ORDER BY `u`.`nama` ASC
---
    public function getMonitoringTaskPerKaryawan()
    {
        return $this->db->table('user u')
            ->select([
                'u.id_user',
                'u.nama AS nama_karyawan',
                // on progress: belum selesai
                "COUNT(CASE WHEN t.tgl_selesai IS NULL THEN 1 END) AS task_on_progress",
                // selesai tepat waktu
                "COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai <= t.tgl_planing THEN 1 END) AS task_selesai",
                // overdue: selesai tapi telat
                "COUNT(CASE WHEN t.tgl_selesai IS NOT NULL AND t.tgl_selesai > t.tgl_planing THEN 1 END) AS task_overdue"
            ])
            ->join('task t', 't.id_user = u.id_user AND t.deleted_at IS NULL', 'left')
            ->where('u.deleted_at IS NULL')
            ->groupBy('u.id_user')
            ->orderBy('u.nama', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `task`
WHERE `id_user` = '22'
AND `deleted_at` IS NULL
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC
---
    public function getAllTaskByUser($id_user)
    {
        return $this->where(['id_user' => $id_user, 'deleted_at' => null])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();