app/Models/PekerjaanModel.php

SELECT *
FROM `pekerjaan`
WHERE `pekerjaan`.`deleted_at` IS NULL
ORDER BY `target_waktu_selesai` ASC
SELECT *
FROM `pekerjaan`
WHERE `id_pekerjaan` = '12'
AND `pekerjaan`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getPekerjaan($id_pekerjaan = false)
    {
        if ($id_pekerjaan === false) {
            return $this->orderBy('target_waktu_selesai', 'ASC')->findAll();
        }
        return $this->where(['id_pekerjaan' => $id_pekerjaan])->first();

SELECT DISTINCT `pekerjaan`.*
FROM `pekerjaan`
JOIN `personil` ON `pekerjaan`.`id_pekerjaan` = `personil`.`id_pekerjaan`
JOIN `user` ON `personil`.`id_user` = `user`.`id_user`
WHERE `personil`.`id_user` = '6'
AND `pekerjaan`.`deleted_at` IS NULL
AND `personil`.`deleted_at` IS NULL
AND `user`.`deleted_at` IS NULL
AND `pekerjaan`.`deleted_at` IS NULL
ORDER BY `pekerjaan`.`target_waktu_selesai` ASC
---
    public function getPekerjaanByUserId($id_user)
    {
        return $this->distinct()
            ->select('pekerjaan.*')
            ->join('personil', 'pekerjaan.id_pekerjaan = personil.id_pekerjaan')
            ->join('user', 'personil.id_user = user.id_user')
            ->where('personil.id_user', $id_user)
            ->where('pekerjaan.deleted_at IS NULL') //perubahan
            ->where('personil.deleted_at IS NULL') //perubahan
            ->where('user.deleted_at IS NULL') //perubahan
            ->orderBy('pekerjaan.target_waktu_selesai', 'ASC') // Mengurutkan hasil berdasarkan id_pekerjaan dalam urutan menurun
            ->findAll();

SELECT *
FROM `pekerjaan`
WHERE `id_status_pekerjaan` = 1
AND `pekerjaan`.`deleted_at` IS NULL
ORDER BY `target_waktu_selesai` ASC
---
    public function getPekerjaanByIdStatusPekerjaan($id_status_pekerjaan)
    {
        return $this->where(['id_status_pekerjaan' => $id_status_pekerjaan])
            ->orderBy('target_waktu_selesai', 'ASC')->findAll();

SELECT DISTINCT `pekerjaan`.*
FROM `pekerjaan`
JOIN `personil` ON `pekerjaan`.`id_pekerjaan` = `personil`.`id_pekerjaan`
JOIN `user` ON `personil`.`id_user` = `user`.`id_user`
WHERE `personil`.`id_user` = '26'
AND `pekerjaan`.`id_status_pekerjaan` = 1
AND `pekerjaan`.`deleted_at` IS NULL
AND `personil`.`deleted_at` IS NULL
AND `user`.`deleted_at` IS NULL
AND `pekerjaan`.`deleted_at` IS NULL
ORDER BY `pekerjaan`.`target_waktu_selesai` ASC
---
    public function getPekerjaanByUserIdIdStatusPekerjaan($id_user, $id_status_pekerjaan)
    {
        return $this->distinct()
            ->select('pekerjaan.*')
            ->join('personil', 'pekerjaan.id_pekerjaan = personil.id_pekerjaan')
            ->join('user', 'personil.id_user = user.id_user')
            ->where('personil.id_user', $id_user)
            ->where('pekerjaan.id_status_pekerjaan', $id_status_pekerjaan)
            ->where('pekerjaan.deleted_at IS NULL') //perubahan
            ->where('personil.deleted_at IS NULL') //perubahan
            ->where('user.deleted_at IS NULL') //perubahan
            ->orderBy('pekerjaan.target_waktu_selesai', 'ASC')
            ->findAll();

SELECT `pekerjaan`.*
FROM `pekerjaan`
JOIN `personil` ON `personil`.`id_pekerjaan` = `pekerjaan`.`id_pekerjaan`
WHERE `personil`.`role_personil` = 'project_manager'
AND `pekerjaan`.`deleted_at` IS NULL
AND `pekerjaan`.`id_status_pekerjaan` = 1
ORDER BY `pekerjaan`.`target_waktu_selesai` ASC
---
    public function getFilteredPekerjaan($id_kategori_pekerjaan, $id_status_pekerjaan, $jenis_layanan, $id_user_pm)
    {
        $query = $this->select('pekerjaan.*')
            ->join('personil', 'personil.id_pekerjaan = pekerjaan.id_pekerjaan')
            ->where('personil.role_personil', 'project_manager')
            ->where('pekerjaan.deleted_at IS NULL');
        if ($id_kategori_pekerjaan !== '') {
            $query->where('pekerjaan.id_kategori_pekerjaan', $id_kategori_pekerjaan);
        }
        if ($id_status_pekerjaan !== '') {
            $query->where('pekerjaan.id_status_pekerjaan', $id_status_pekerjaan);
        }
        if ($jenis_layanan !== '') {
            $query->where('pekerjaan.jenis_layanan', $jenis_layanan);
        }
        if ($id_user_pm !== '') {
            $query->where('personil.id_user', $id_user_pm);
        }
        $query->orderBy('pekerjaan.target_waktu_selesai', 'ASC');
        return $query->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `pekerjaan`
WHERE `deleted_at` IS NULL
AND `pekerjaan`.`deleted_at` IS NULL
---
    public function countPekerjaan()
    {
        return $this->where(['deleted_at' => null])->countAllResults();

SELECT DISTINCT `pekerjaan`.*
FROM `pekerjaan`
JOIN `personil` ON `pekerjaan`.`id_pekerjaan` = `personil`.`id_pekerjaan`
JOIN `user` ON `personil`.`id_user` = `user`.`id_user`
WHERE `personil`.`id_user` = '14'
AND YEAR(pekerjaan.target_waktu_selesai) = '2025'
AND `pekerjaan`.`deleted_at` IS NULL
AND `personil`.`deleted_at` IS NULL
AND `user`.`deleted_at` IS NULL
AND `pekerjaan`.`deleted_at` IS NULL
ORDER BY `pekerjaan`.`target_waktu_selesai` ASC
---
    public function getAllPekerjaanByUserId_tahun($id_user, $tahun_target_waktu_selesai)
    {
        return $this->distinct()
            ->select('pekerjaan.*')
            ->join('personil', 'pekerjaan.id_pekerjaan = personil.id_pekerjaan')
            ->join('user', 'personil.id_user = user.id_user')
            ->where('personil.id_user', $id_user)
            ->where('YEAR(pekerjaan.target_waktu_selesai)', $tahun_target_waktu_selesai)
            ->where('pekerjaan.deleted_at IS NULL') //perubahan
            ->where('personil.deleted_at IS NULL') //perubahan
            ->where('user.deleted_at IS NULL') //perubahan
            ->orderBy('pekerjaan.target_waktu_selesai', 'ASC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `task`
WHERE `id_pekerjaan` = '23'
AND `deleted_at` IS NULL
AND   (
`tgl_selesai` IS NULL
AND NOW() <= tgl_planing
 )
AND `task`.`deleted_at` IS NULL
---
    public function countTaskOnProgressByIdPekerjaan($id_pekerjaan)
    {
        $taskModel = new \App\Models\TaskModel();
        return $taskModel
            ->where('id_pekerjaan', $id_pekerjaan)
            ->where('deleted_at', null)
            ->groupStart()
            ->where('tgl_selesai', null)
            ->where('NOW() <= tgl_planing')
            ->groupEnd()
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `task`
WHERE `id_pekerjaan` = '23'
AND `deleted_at` IS NULL
AND   (
   (
`tgl_selesai` IS NULL
AND NOW() > tgl_planing
  )
OR    (
tgl_selesai IS NOT NULL
AND `tgl_selesai` > tgl_planing
  )
 )
AND `task`.`deleted_at` IS NULL
---
    public function countTaskOverdueByIdPekerjaan($id_pekerjaan)
    {
        $taskModel = new \App\Models\TaskModel();
        return $taskModel
            ->where('id_pekerjaan', $id_pekerjaan)
            ->where('deleted_at', null)
            ->groupStart()
            ->groupStart()
            ->where('tgl_selesai', null)
            ->where('NOW() > tgl_planing')
            ->groupEnd()
            ->orgroupStart()
            ->where('tgl_selesai IS NOT NULL', null, false)
            ->Where('tgl_selesai > tgl_planing')
            ->groupEnd()
            ->groupEnd()
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `task`
WHERE `id_pekerjaan` = '23'
AND `deleted_at` IS NULL
AND tgl_selesai IS NOT NULL
AND `tgl_selesai` = tgl_planing
AND `task`.`deleted_at` IS NULL
---
    public function countTaskOnTargetByIdPekerjaan($id_pekerjaan)
    {
        $taskModel = new \App\Models\TaskModel();
        return $taskModel
            ->where('id_pekerjaan', $id_pekerjaan)
            ->where('deleted_at', null)
            ->where('tgl_selesai IS NOT NULL', null, false)
            ->where('tgl_selesai = tgl_planing')
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `task`
WHERE `id_pekerjaan` = '23'
AND `deleted_at` IS NULL
AND tgl_selesai IS NOT NULL
AND `tgl_selesai` < tgl_planing
AND `task`.`deleted_at` IS NULL
---
    public function countTaskPercepatanByIdPekerjaan($id_pekerjaan)
    {
        $taskModel = new \App\Models\TaskModel();
        return $taskModel
            ->where('id_pekerjaan', $id_pekerjaan)
            ->where('deleted_at', null)
            ->where('tgl_selesai IS NOT NULL', null, false)
            ->where('tgl_selesai < tgl_planing')
            ->countAllResults();

SELECT `task`.`deskripsi_task`, `user`.`nama`, `kategori_task`.`nama_kategori_task`, `task`.`tgl_selesai`, `task`.`tgl_planing`, `kategori_task`.`color`
FROM `task`
JOIN `user` ON `user`.`id_user` = `task`.`id_user`
LEFT JOIN `kategori_task` ON `kategori_task`.`id_kategori_task` = `task`.`id_kategori_task`
WHERE `task`.`id_pekerjaan` = '5'
AND `task`.`deleted_at` IS NULL
AND task.tgl_selesai IS NOT NULL
AND `task`.`tgl_selesai` < `task`.`tgl_planing`
AND `task`.`deleted_at` IS NULL
---
    public function getTaskPercepatanByPekerjaan($id_pekerjaan)
    {
        $taskModel = new \App\Models\TaskModel();
        return $taskModel->join('user', 'user.id_user = task.id_user')
            ->join('kategori_task', 'kategori_task.id_kategori_task = task.id_kategori_task ', 'left')
            ->select('task.deskripsi_task, user.nama, kategori_task.nama_kategori_task, task.tgl_selesai, task.tgl_planing, kategori_task.color')
            ->where('task.id_pekerjaan', $id_pekerjaan)
            ->where('task.deleted_at', null)
            ->where('task.tgl_selesai IS NOT NULL', null, false)
            ->where('task.tgl_selesai < task.tgl_planing')
            ->findAll();

SELECT `pekerjaan`.`id_pekerjaan`, `pekerjaan`.`waktu_selesai`, `pekerjaan`.`target_waktu_selesai`, CASE
            WHEN ((pekerjaan.waktu_selesai IS NOT NULL AND pekerjaan.waktu_selesai > pekerjaan.target_waktu_selesai) OR (pekerjaan.waktu_selesai IS NULL AND NOW() > pekerjaan.target_waktu_selesai)) THEN 'overdue'
            WHEN (pekerjaan.waktu_selesai IS NOT NULL AND pekerjaan.waktu_selesai = pekerjaan.target_waktu_selesai) THEN 'on target'
            WHEN (pekerjaan.waktu_selesai IS NOT NULL AND pekerjaan.waktu_selesai < pekerjaan.target_waktu_selesai) THEN 'percepatan'
            WHEN (pekerjaan.waktu_selesai IS NULL AND NOW() < pekerjaan.target_waktu_selesai) THEN 'on progress'
        END AS status_pengerjaan_pekerjaan
FROM `pekerjaan`
WHERE `pekerjaan`.`id_pekerjaan` = '23'
AND `pekerjaan`.`deleted_at` IS NULL
AND `pekerjaan`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getStatusPengerjaanPekerjaanByPekerjaan($id_pekerjaan)
    {
        $pekerjaanModel = new \App\Models\PekerjaanModel();
        return $pekerjaanModel->select("
        pekerjaan.id_pekerjaan,
        pekerjaan.waktu_selesai,
        pekerjaan.target_waktu_selesai,
        CASE
            WHEN ((pekerjaan.waktu_selesai IS NOT NULL AND pekerjaan.waktu_selesai > pekerjaan.target_waktu_selesai) OR (pekerjaan.waktu_selesai IS NULL AND NOW() > pekerjaan.target_waktu_selesai)) THEN 'overdue'
            WHEN (pekerjaan.waktu_selesai IS NOT NULL AND pekerjaan.waktu_selesai = pekerjaan.target_waktu_selesai) THEN 'on target'
            WHEN (pekerjaan.waktu_selesai IS NOT NULL AND pekerjaan.waktu_selesai < pekerjaan.target_waktu_selesai) THEN 'percepatan'
            WHEN (pekerjaan.waktu_selesai IS NULL AND NOW() < pekerjaan.target_waktu_selesai) THEN 'on progress'
        END AS status_pengerjaan_pekerjaan ")
            ->where('pekerjaan.id_pekerjaan', $id_pekerjaan)
            ->where('pekerjaan.deleted_at', null)
            ->first()['status_pengerjaan_pekerjaan'] ?? '-';