app/Models/TaskModel.php

    public function getTask($id_task)
    {
        return $this->where(['id_task' => $id_task])->first();
---
SELECT *
FROM `task`
WHERE `id_task` = '204'
AND `task`.`deleted_at` IS NULL
 LIMIT 1

    public function getTaskAll_ByIdPekerjaan($id_pekerjaan)
    {
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '23'
AND `deleted_at` IS NULL
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskSelesaiTidakTerlambat($id_user, $tahun, $bulan)
    {
        return $this->where(['id_user' => $id_user, 'YEAR(tgl_selesai)' => $tahun, 'MONTH(tgl_selesai)' => $bulan, 'id_status_task' => 3])
            ->where('tgl_selesai <= tgl_planing')
            ->orderBy('tgl_selesai', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_user` = '26'
AND YEAR(tgl_selesai) = '2025'
AND MONTH(tgl_selesai) = '7'
AND `id_status_task` = 3
AND `tgl_selesai` <= tgl_planing
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_selesai` ASC

    public function getTaskHariIni_BelumSubmit_ByIdPekerjaan($id_pekerjaan)
    {
        $today = date('Y-m-d'); // Mendapatkan tanggal hari ini
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'tgl_planing' => $today, 'id_status_task' => 1])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `tgl_planing` = '2025-07-30'
AND `id_status_task` = 1
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskPlaning_BelumSubmit_ByIdPekerjaan($id_pekerjaan)
    {
        $today = date('Y-m-d'); // Mendapatkan tanggal hari ini
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'tgl_planing >' => $today, 'id_status_task' => 1])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `tgl_planing` > '2025-07-30'
AND `id_status_task` = 1
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskOverdue_BelumSubmit_ByIdPekerjaan($id_pekerjaan)
    {
        $today = date('Y-m-d'); // Mendapatkan tanggal hari ini
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'tgl_planing <' => $today, 'id_status_task' => 1])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `tgl_planing` < '2025-07-30'
AND `id_status_task` = 1
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskHariIni_Ditolak_ByIdPekerjaan($id_pekerjaan)
    {
        $today = date('Y-m-d'); // Mendapatkan tanggal hari ini
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'tgl_planing' => $today, 'id_status_task' => 4])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `tgl_planing` = '2025-07-30'
AND `id_status_task` = 4
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskPlaning_Ditolak_ByIdPekerjaan($id_pekerjaan)
    {
        $today = date('Y-m-d'); // Mendapatkan tanggal hari ini
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'tgl_planing >' => $today, 'id_status_task' => 4])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `tgl_planing` > '2025-07-30'
AND `id_status_task` = 4
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskOverdue_Ditolak_ByIdPekerjaan($id_pekerjaan)
    {
        $today = date('Y-m-d'); // Mendapatkan tanggal hari ini
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'tgl_planing <' => $today, 'id_status_task' => 4])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `tgl_planing` < '2025-07-30'
AND `id_status_task` = 4
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskMenungguVerifikasi_ByIdPekerjaan($id_pekerjaan)
    {
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'id_status_task' => 2])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `id_status_task` = 2
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function getTaskSelesai_ByIdPekerjaan($id_pekerjaan)
    {
        return $this->where(['id_pekerjaan' => $id_pekerjaan, 'deleted_at' => null, 'id_status_task' => 3])
            ->orderBy('tgl_planing', 'ASC')
            ->findAll();
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` = '12'
AND `deleted_at` IS NULL
AND `id_status_task` = 3
AND `task`.`deleted_at` IS NULL
ORDER BY `tgl_planing` ASC

    public function countTaskSelesai_TahunIni_BulanIni($tahun, $bulan)
    {
        return count($this->where(['YEAR(tgl_selesai)' => $tahun, 'MONTH(tgl_selesai)' => $bulan, 'deleted_at' => null, 'id_status_task' => 3])->findAll());
---
SELECT *
FROM `task`
WHERE YEAR(tgl_selesai) = '2025'
AND MONTH(tgl_selesai) = '7'
AND `deleted_at` IS NULL
AND `id_status_task` = 3
AND `task`.`deleted_at` IS NULL

    public function countTaskSelesai_TahunIni_BulanIni_ByIdUser($tahun, $bulan, $id_user)
    {
        return count($this->where(['YEAR(tgl_selesai)' => $tahun, 'MONTH(tgl_selesai)' => $bulan, 'id_user' => $id_user, 'deleted_at' => null, 'id_status_task' => 3])->findAll());
---
SELECT *
FROM `task`
WHERE YEAR(tgl_selesai) = '2025'
AND MONTH(tgl_selesai) = '7'
AND `id_user` = '26'
AND `deleted_at` IS NULL
AND `id_status_task` = 3
AND `task`.`deleted_at` IS NULL

    public function countTaskOverdue_OnProgress_Cancel_At_Pekerjaan_Presales_OnProgress_Support($id_user = false)
    {
        $today = date('Y-m-d'); // Mendapatkan tanggal hari ini
        //Mendapatkan semua pekerjaan yang statusnya presales, on progress, dan support
        $pekerjaanModel = new \App\Models\PekerjaanModel();
        $pekerjaan_presales = $pekerjaanModel->getPekerjaanByIdStatusPekerjaan(1);
        $pekerjaan_onprogress = $pekerjaanModel->getPekerjaanByIdStatusPekerjaan(2);
        $pekerjaan_support = $pekerjaanModel->getPekerjaanByIdStatusPekerjaan(4);
        //Menggabungkan semua pekejaan
        $pekerjaan = array_merge($pekerjaan_presales, $pekerjaan_onprogress, $pekerjaan_support);
        //Mendapatkan semua id pekerjaan
        $id_pekerjaan = [];
        foreach ($pekerjaan as $p) {
            $id_pekerjaan[] = isset($p['id_pekerjaan'])?$p['id_pekerjaan']:'';
        }
        if ($id_user) {
            //Mendapatkan semua task yang status task nya onprogress dan cancel yang overdue berdasarkan id user
            return count($this->whereIn('id_pekerjaan', $id_pekerjaan)
                ->where('tgl_planing <', $today)
                ->whereIn('id_status_task', [1, 4])
                ->where('id_user', $id_user)
                ->findAll());
---
SELECT *
FROM `task`
WHERE `id_pekerjaan` IN ('20','25','26','16','5','7','19','24','1','21','22','18','23','8','3','4','6','9','10','2')
AND `tgl_planing` < '2025-07-14'
AND `id_status_task` IN (1,4)
AND `id_user` = '26'
AND `task`.`deleted_at` IS NULL